app/controllers/chores_controller.rb

  def index
    @chores = Chore.all
---
SELECT "chores".* FROM "chores"

  def edit
    @chore = Chore.find(params[:id])
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = 72 LIMIT 1

  def create
    @chore = Chore.new(params[:chore])

    respond_to do |format|
      if @chore.save
---
INSERT INTO "chores" ("updated_at", "finished", "created_at", "description", "name") VALUES ('2011-06-19 23:35:10.187390', NULL, '2011-06-19 23:35:10.187390', 'This is the first test dude', 'Test chore')

  def update
    @chore = Chore.find(params[:id])

    respond_to do |format|
      if @chore.update_attributes(params[:chore])
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = 72 LIMIT 1
UPDATE "chores" SET "description" = 'aaaaaa', "updated_at" = '2011-06-13 22:45:33.323281' WHERE "chores"."id" = 72

  def destroy
    @chore = Chore.find(params[:id])
    @chore.destroy
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = 70 LIMIT 1
DELETE FROM "chores" WHERE "chores"."id" = 70