app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "name", "description", "updated_at", "finished") VALUES ('2011-05-28 22:38:46.688917', 'Pet a cat', 'Just pet a cat. Doesn''t matter which cat.', '2011-05-28 22:38:46.688917', 'f')
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "updated_at" = '2011-05-26 01:40:44.002564', "name" = 'agagagagagageg4g4g4gagahwgwgg', "description" = 'ss' WHERE "tasks"."id" = 7
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])